# Getting started with pandas

In [181]:
from pandas import Series, DataFrame
import pandas as pd

In [182]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [ ]:
%pwd

## Introduction to pandas data structures

### Series

In [6]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
obj.values
obj.index

In [18]:
# 值的数量和索引数量必须匹配
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
# 返回索引对象
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [ ]:
# 根据索引访问
obj2['a']

In [19]:
obj2['d'] = 6
# 使用索引数组访问，类似切片功能。
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [10]:
# 按条件访问
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [20]:
# 操作作用在每个元素上
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
# 判断索引是否存在，而不是值。
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
# dict的key作为索引
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [22]:
# 重新指定索引顺序，不匹配的设置值为NaN。
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
# 输出每个索引对应的值是否为null
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [ ]:
pd.notnull(obj4)

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
# 对应索引位置的值相加，有一个为NaN，则置为NaN。
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
# 给Series和索引设置名字
obj4.name = 'population'
obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
# 替换之前的索引
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [32]:
# dict的key作为每一列的名字
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [33]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [37]:
# 重新指定列的顺序，如果column不在data的key里，对应列的值为空。
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [38]:
# index对应每一行的索引
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
# 列的名字
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
# 获取某一列的数据
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
# 创建DataFrame时，列的名字会转换为对应的属性。
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
# 根据索引访问行
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [43]:
# 添加新的一列并初始化对应的值
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [44]:
# 用一个numpy数组初始化列的值
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [45]:
# 用一个Series数组初始化列的值，注意index的匹配。
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [46]:
# 布尔判断初始化
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [47]:
# 删除列
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [48]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [49]:
# 字典嵌套，外层key作为列的名字，内层key作为行索引的名字。
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [50]:
# 转置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [51]:
# 指定行索引，不匹配置为NaN。
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [52]:
# 切片构造，frame3[xx][:]，先选列再选行。
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [53]:
# 索引命名
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [ ]:
# 以数组形式打印值
frame3.values

In [ ]:
frame2.values

### Index objects

In [56]:
# 直接获取索引对象
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [57]:
# 切片访问
index[1:]

Index(['b', 'c'], dtype='object')

In [58]:
# 索引对象只读，更改会报错。
index[1] = 'd'

TypeError: Index does not support mutable operations

In [59]:
# 创建一个索引对象，并用于Series对象创建。
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [60]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [61]:
# 判断列是否存在
'Ohio' in frame3.columns

True

In [62]:
# 判断行是否存在
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [63]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [64]:
# 根据索引重新排列值，e没有对应值，所以置为NaN。
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [65]:
# 对于NaN，指定用0填充。
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [66]:
# 对于NaN，使用上一个有效值填充。
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [67]:
# 直接指定行索引和列名
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [68]:
# 重排行索引，b是新添加的，原来没有对应的值，置为NaN。
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [69]:
# 调整列顺序，Utah是新添加的，原来没有对应的值，置为NaN。
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [71]:
# ffill用上一行内容填充，因为Utah这列原来不存在，所以所有值置为NaN。
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [72]:
# 使用ix重新指定行索引与列
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [73]:
# 根据索引删除行
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [74]:
# 删除多行
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [76]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [77]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
# axis=1代表删除列
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [79]:
# 删除多列
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [80]:
# 用行索引访问
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [81]:
# 默认的位置索引依然可用
obj[1]

1.0

In [82]:
# 切片，使用位置索引的话是前闭后开区间。
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [83]:
# 一次指定多个索引位置
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [84]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [85]:
# 布尔索引，选择满足条件的元素。
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [86]:
# 名字索引，使用闭区间。
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [87]:
# 区间赋值
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [88]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
# 注意，DataFrame用[]是访问列
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [ ]:
data[['three', 'one']]

In [96]:
# 注意，这里有坑！
# 用切片的方式是访问行
data[:2] # data['Ohio':'Utah']

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [97]:
# 针对行来做筛选，只要'three'列的元素大于5，该行就保留。
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
# 按元素逐个比较
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [99]:
# 所有小于5的元素都置为0
data[data < 5] = 0

In [100]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
# ix，前半部分是行，后半部分是列。
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [102]:
# 行列组合
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [103]:
# 第2行（索引从0开始）
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [104]:
# 从第1行直到'Utah'行，'two'列
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [ ]:
data.ix[data.three > 5, :3]

### Arithmetic and data alignment

In [105]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [106]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [107]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [108]:
# 相同索引的元素相加，有一个对不上就NaN。
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [109]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [110]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [111]:
# 按照对应的行列位置相加，有一个对不上就NaN。
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [112]:
# list()把字符串转换成数组
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [113]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [114]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [115]:
# NaN用0填充
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
# 根据df2的列名字调整df1的列，不匹配的全部填0（e列）。
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [117]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [118]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [119]:
# 每一行对应位置元素相减
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [120]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
# 取第一行
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [121]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [122]:
# 每一行对应位置元素相减
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [123]:
# 每一行对应位置元素相加，对不起来就置为NaN。
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [124]:
# 取'd'列
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [125]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [126]:
# axis=0，表示对于每一列，从上到下沿着对应元素进行减法操作。
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [127]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [128]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [129]:
# 对每个元素取绝对值
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [130]:
# 求最大值与最小值之差
f = lambda x: x.max() - x.min()

In [131]:
# 默认每一列应用f
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [132]:
# axis=1，每一行应用f
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [133]:
# f(x)生成一个新的Series，对应的索引分别为min和max。
# 默认axis=0，对于原来的每一列，因为沿着列操作，会转换成min和max2行。
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [134]:
# 对每个元素应用format函数
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [136]:
# 对列上的每个元素应用format函数
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [137]:
# 对索引做排序
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [139]:
# 按行索引排序
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [141]:
# axis=1，按列名称进行排序
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [142]:
# axis=1，按列名称进行排序（降序）
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [144]:
obj = Series([4, 7, -3, 2])
# 使用sort_values替代order函数
# 按值排序，索引跟着变化。
# obj.order()
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [146]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
# obj.order()
# NaN排在最后
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [147]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [153]:
# frame.sort_index(by='b')
# 根据某一列的值排序，DataFrame必须指定列。
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [154]:
# 先按列'a'，再按列'b'。
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [156]:
'''
Rank统计每个值按顺序位置出现的平均柱
obj排序后应该是[-5, 0, 2, 4, 4, 7, 7]，Rank统计从1开始。
7的平均值就是6.5，所欲r[0]和r[2]是6.5，别的依次类推。
'''
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [157]:
# 取第一次出现的位置，不用平均。
# 所以第一个7是6，第二个7是7。
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [158]:
# 逆序，而且取出现的最大位置。
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [159]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [160]:
# axis=1，沿着每一行使用rank函数。
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [161]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [162]:
# 判断索引是否有重复
obj.index.is_unique

False

In [163]:
# 索引有2个'a'，所以返回全部结果。
obj['a']

a    0
a    1
dtype: int32

In [164]:
obj['c']

4

In [165]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [169]:
# 返回2行'b'，也就是一个更小的DataFrame。
df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [170]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [171]:
# 对每一列求和
df.sum()

one    9.25
two   -5.80
dtype: float64

In [172]:
# 对每一行求和
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [173]:
# 按行求和，并且不忽略NaN。
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [174]:
# 返回每一列最大值所在行的索引值
df.idxmax()

one    b
two    d
dtype: object

In [ ]:
df.cumsum()

In [ ]:
df.describe()

In [ ]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

### Correlation and covariance

In [189]:
# import pandas.io.data as web 改成用pandas_datareader
from pandas_datareader import data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
# iteritems => items
price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [190]:
# 获取每天的股价变化率
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2017-08-16 -0.004022  0.005140  0.003027  0.005873
2017-08-17 -0.019198 -0.017239 -0.012632 -0.016972
2017-08-18 -0.002281 -0.000340 -0.007107  0.001243
2017-08-21 -0.001841 -0.004403  0.004510 -0.004690
2017-08-22  0.016348  0.019886  0.004846  0.013999

In [191]:
# 返回MSFT与IBM的相关系数
returns.MSFT.corr(returns.IBM)

0.48399829560558111

In [192]:
# 返回MSFT与IBM的协方差
returns.MSFT.cov(returns.IBM)

8.0929037230072321e-05

In [193]:
# 返回相关系数矩阵
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.414117  0.368435  0.394465
GOOG  0.414117  1.000000  0.391845  0.476191
IBM   0.368435  0.391845  1.000000  0.483998
MSFT  0.394465  0.476191  0.483998  1.000000

In [194]:
# 返回协方差矩阵
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000260  0.000102  0.000070  0.000090
GOOG  0.000102  0.000235  0.000071  0.000103
IBM   0.000070  0.000071  0.000139  0.000081
MSFT  0.000090  0.000103  0.000081  0.000201

In [195]:
# 返回所有股票与IBM的相关系数
returns.corrwith(returns.IBM)

AAPL    0.368435
GOOG    0.391845
IBM     1.000000
MSFT    0.483998
dtype: float64

In [196]:
# 涨跌与成交量的相关性
returns.corrwith(volume)

AAPL   -0.072311
GOOG   -0.013862
IBM    -0.210231
MSFT   -0.090574
dtype: float64

### Unique values, value counts, and membership

In [200]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [201]:
# 返回去重后的元素
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [202]:
# 数量统计
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [203]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
a    3
d    1
dtype: int64

In [204]:
# 判断每个元素是不是属于['b', 'c']
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [205]:
# 根据布尔数组选择元素
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [212]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [213]:
'''
直接看有点懵！
实际是这么做的，首先把所有的值去重之后作为result的行索引。
然后每一列的值就是原来每一列里的值在这一列里出现的次数。
以索引3为例，在data的第一列里出现2次，所以对应值为2.
以索引5为例，在data的第一、二列里都没有出现，但是fillna设置了填充值为0。
'''
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [214]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [215]:
# 判断每个元素是否为NULL
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [216]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [217]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
data[data.notnull()]

In [218]:
# 删除含有空元素的行
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [219]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [221]:
# 行上所有元素为NA才删除对应行
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [222]:
# 新加一列并初始化值为NA
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [223]:
# 列上所有元素为NA才删除对应列
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [224]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN       NaN
3  1.246435       NaN -1.296221
4  0.274992       NaN  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [227]:
# 每一行至少有3个元素不为NA才保留
df.dropna(thresh=3)

          0         1         2
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling in missing data

In [228]:
# 使用0进行填充
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.000000
3  1.246435  0.000000 -1.296221
4  0.274992  0.000000  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [232]:
# 列1使用0.5填充，列3使用-1填充（因为没有列3，所以没有影响。）
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.204708  0.500000       NaN
1 -0.555730  0.500000       NaN
2  0.092908  0.500000       NaN
3  1.246435  0.500000 -1.296221
4  0.274992  0.500000  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [233]:
# always returns a reference to the filled object
# 原地填充，不生成一个新的DataFrame。
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.000000
3  1.246435  0.000000 -1.296221
4  0.274992  0.000000  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [234]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [235]:
# 使用上一行对应列的元素进行填充
df.fillna(method='ffill')

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232

In [236]:
# 使用上一行对应列的元素进行填充，但是最多填2次。
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [237]:
# 用平均值进行填充
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [238]:
# 行索引一一对应
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.332883
   2   -2.359419
   3   -0.199543
b  1   -1.541996
   2   -0.970736
   3   -1.307030
c  1    0.286350
   2    0.377984
d  2   -0.753887
   3    0.331286
dtype: float64

In [239]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [240]:
data['b']

1   -1.541996
2   -0.970736
3   -1.307030
dtype: float64

In [ ]:
data['b':'c']

In [241]:
data.ix[['b', 'd']]

b  1   -1.541996
   2   -0.970736
   3   -1.307030
d  2   -0.753887
   3    0.331286
dtype: float64

In [242]:
# 第二层行索引为2的所有元素
data[:, 2]

a   -2.359419
b   -0.970736
c    0.377984
d   -0.753887
dtype: float64

In [243]:
# 把第二层行索引扔到列上
data.unstack()

          1         2         3
a  0.332883 -2.359419 -0.199543
b -1.541996 -0.970736 -1.307030
c  0.286350  0.377984       NaN
d       NaN -0.753887  0.331286

In [ ]:
# 把列名字转成第二层行索引
data.unstack().stack()

In [244]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [245]:
# 行和列都可以有多层索引，并命名。
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [246]:
# 按第一层列名访问
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

# 构造多层索引
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [247]:
# 交换行索引位置，根据名字做交换。
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [249]:
# 根据第二层索引进行排序
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [250]:
# 交换后根据第一层索引排序
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [251]:
# 根据指定的索引求和
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [252]:
# 沿着每一行，计算相同列名元素的和。
# 比如Ohio有Green，Colorado有Green，同一行上的值加起来放到对应的Green列。
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [253]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [254]:
# 使用'c'和'd'列的值作为新的行索引，同时'c'和'd'作为新索引的名字。
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [255]:
# 保留原来的列
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [256]:
# 把索引塞回去...
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [257]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [258]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [259]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [260]:
# 使用闭区间访问索引
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [261]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [262]:
# 获取第一行
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

### Panel data

In [270]:
# import pandas.io.data as web
from pandas_datareader import data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOGL', 'MSFT', 'AMZN']))

In [267]:
# 一个股票一层，行索引是日期，列是价格、交易量等信息。
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1923 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-08-22 00:00:00
Minor_axis axis: Open to Volume

In [271]:
# 这个交换略复杂，最好自己画个方块理解一下。
# 交换后，原来的列名字对应每一层，现在每一列对应每个股票。
# 获取切面'Adj Close'
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL         AMZN       GOOGL       MSFT
Date
2010-01-04   27.505054   133.899994  313.688690  25.275177
2010-01-05   27.552608   134.690002  312.307312  25.283342
2010-01-06   27.114347   132.250000  304.434448  25.128178
2010-01-07   27.064222   130.000000  297.347351  24.866852
2010-01-08   27.244156   133.520004  301.311310  25.038349
2010-01-11   27.003820   130.309998  300.855865  24.719858
2010-01-12   26.696650   127.349998  295.535522  24.556530
2010-01-13   27.073221   129.110001  293.838837  24.785191
2010-01-14   26.916422   127.349998  295.220215  25.283342
2010-01-15   26.466595   127.139999  290.290283  25.201679
2010-01-19   27.637430   127.610001  294.104095  25.397671
2010-01-20   27.212029   125.779999  290.495483  24.981182
2010-01-21   26.741631   126.620003  291.781769  24.507528
2010-01-22   25.415281   121.430000  275.280273  23.650047
2010-01-25   26.099028   120.309998  270.270264  23.944042
2010-01-26   26.467880   119.480003  271.481476  24.091042
2010-01-27   26.717218   122.750000  271.321320  24.229874
2010-01-28   25.613209   126.029999  267.412415  23.813379
2010-01-29   24.683992   125.410004  265.235229  23.013071
2010-02-01   25.027143   118.870003  266.776764  23.200891
2010-02-02   25.172379   118.120003  265.825836  23.241730
2010-02-03   25.605494   119.099998  270.680695  23.380560
2010-02-04   24.682707   115.940002  263.653656  22.735409
2010-02-05   25.120964   117.389999  265.910919  22.882408
2010-02-08   24.948748   116.830002  267.002014  22.637409
2010-02-09   25.214790   118.029999  268.488495  22.874241
2010-02-10   25.077271   117.360001  267.492493  22.857906
2010-02-11   25.533520   120.089996  268.468475  22.964071
2010-02-12   25.753294   119.660004  266.826813  22.808908
2010-02-16   26.141434   117.529999  270.920929  23.260166
...                ...          ...         ...        ...
2017-07-12  145.169922  1006.510010  967.659973  70.772934
2017-07-13  147.191986  1000.630005  968.849976  71.389641
2017-07-14  148.457001  1001.809998  976.909973  72.394295
2017-07-17  148.974976  1010.039978  975.960022  72.961273
2017-07-18  149.492950  1024.449951  986.950012  72.911537
2017-07-19  150.429276  1026.869995  992.770020  73.468567
2017-07-20  149.751923  1028.699951  992.190002  73.826660
2017-07-21  149.682205  1025.670044  993.840027  73.398941
2017-07-24  151.495071  1038.949951  998.309998  73.209946
2017-07-25  152.142548  1039.869995  969.030029  73.796822
2017-07-26  152.859726  1052.800049  965.309998  73.657562
2017-07-27  149.971069  1046.000000  952.510010  72.772285
2017-07-28  148.915207  1020.039978  958.330017  72.652916
2017-07-31  148.148224   987.780029  945.500000  72.314713
2017-08-01  149.463058   996.190002  946.559998  72.195358
2017-08-02  156.525330   995.890015  947.640015  71.877052
2017-08-03  154.961472   986.919983  940.299988  71.767632
2017-08-04  155.778259   987.580017  945.789978  72.294823
2017-08-07  158.188797   992.270020  945.750000  72.016312
2017-08-08  159.453827   989.840027  944.190002  72.404243
2017-08-09  160.429993   982.010010  940.080017  72.085938
2017-08-10  155.320007   956.919983  923.590027  71.031555
2017-08-11  157.479996   967.989990  930.090027  72.115776
2017-08-14  159.850006   983.299988  938.929993  73.199997
2017-08-15  161.600006   982.739990  938.080017  73.220001
2017-08-16  160.949997   978.179993  944.270020  73.650002
2017-08-17  157.860001   960.570007  927.659973  72.400002
2017-08-18  157.500000   958.469971  926.179993  72.489998
2017-08-21  157.210007   953.289978  920.869995  72.150002
2017-08-22  159.779999   966.900024  940.400024  73.160004

[1923 rows x 4 columns]

In [272]:
# [切面，行，列]
# 行指定了，列变为行索引，切莫对应成列。
pdata.ix[:, '6/1/2012', :]

             Open        High         Low       Close   Adj Close       Volume
AAPL    81.308571   81.807144   80.074287   80.141426   72.099739  130246900.0
AMZN   208.440002  211.229996  207.300003  208.220001  208.220001    3951500.0
GOOGL  286.181183  286.611603  284.459473  285.775787  285.775787    6109600.0
MSFT    28.760000   28.959999   28.440001   28.450001   24.668653   56634300.0

In [273]:
# 在'Adj Close'切莫上，取2012-05-22及之后的所有数据。
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL         AMZN       GOOGL       MSFT
Date
2012-05-22   71.583061   215.330002  300.700714  25.804539
2012-05-23   73.329674   217.279999  305.035034  25.240936
2012-05-24   72.656212   215.240005  302.132141  25.206251
2012-05-25   72.266800   212.889999  296.061066  25.197577
2012-05-29   73.549454   214.750000  297.467468  25.631123
2012-05-30   74.436249   209.229996  294.409424  25.440367
2012-05-31   74.251175   212.910004  290.720734  25.310303
2012-06-01   72.099739   208.220001  285.775787  24.668653
2012-06-04   72.523842   214.570007  289.584595  24.755363
2012-06-05   72.336205   213.210007  285.490479  24.720682
2012-06-06   73.445358   217.639999  290.575562  25.449030
2012-06-07   73.478767   218.800003  289.404419  25.344986
2012-06-08   74.584061   218.479996  290.515503  25.709158
2012-06-11   73.408081   216.500000  284.534546  25.058844
2012-06-12   74.049400   216.419998  282.832825  25.397011
2012-06-13   73.535316   214.729996  280.825836  25.258274
2012-06-14   73.454330   214.449997  279.804810  25.440367
2012-06-15   73.788521   218.350006  282.537537  26.029984
2012-06-18   75.285774   222.660004  285.710724  25.873913
2012-06-19   75.495277   224.029999  291.056061  26.619606
2012-06-20   75.280624   223.020004  289.044037  26.819031
2012-06-21   74.243469   220.570007  282.887878  26.134035
2012-06-22   74.812836   222.160004  286.026031  26.619606
2012-06-25   73.356667   220.070007  280.630646  25.899921
2012-06-26   73.518631   225.610001  282.622620  26.029984
2012-06-27   73.836052   225.619995  284.934937  26.160044
2012-06-28   73.135612   221.309998  282.437439  25.934605
2012-06-29   75.057014   228.350006  290.325317  26.524225
2012-07-02   76.152031   229.320007  290.525513  26.498209
2012-07-03   77.037544   229.529999  294.209198  26.671631
...                ...          ...         ...        ...
2017-07-12  145.169922  1006.510010  967.659973  70.772934
2017-07-13  147.191986  1000.630005  968.849976  71.389641
2017-07-14  148.457001  1001.809998  976.909973  72.394295
2017-07-17  148.974976  1010.039978  975.960022  72.961273
2017-07-18  149.492950  1024.449951  986.950012  72.911537
2017-07-19  150.429276  1026.869995  992.770020  73.468567
2017-07-20  149.751923  1028.699951  992.190002  73.826660
2017-07-21  149.682205  1025.670044  993.840027  73.398941
2017-07-24  151.495071  1038.949951  998.309998  73.209946
2017-07-25  152.142548  1039.869995  969.030029  73.796822
2017-07-26  152.859726  1052.800049  965.309998  73.657562
2017-07-27  149.971069  1046.000000  952.510010  72.772285
2017-07-28  148.915207  1020.039978  958.330017  72.652916
2017-07-31  148.148224   987.780029  945.500000  72.314713
2017-08-01  149.463058   996.190002  946.559998  72.195358
2017-08-02  156.525330   995.890015  947.640015  71.877052
2017-08-03  154.961472   986.919983  940.299988  71.767632
2017-08-04  155.778259   987.580017  945.789978  72.294823
2017-08-07  158.188797   992.270020  945.750000  72.016312
2017-08-08  159.453827   989.840027  944.190002  72.404243
2017-08-09  160.429993   982.010010  940.080017  72.085938
2017-08-10  155.320007   956.919983  923.590027  71.031555
2017-08-11  157.479996   967.989990  930.090027  72.115776
2017-08-14  159.850006   983.299988  938.929993  73.199997
2017-08-15  161.600006   982.739990  938.080017  73.220001
2017-08-16  160.949997   978.179993  944.270020  73.650002
2017-08-17  157.860001   960.570007  927.659973  72.400002
2017-08-18  157.500000   958.469971  926.179993  72.489998
2017-08-21  157.210007   953.289978  920.869995  72.150002
2017-08-22  159.779999   966.900024  940.400024  73.160004

[1322 rows x 4 columns]

In [274]:
# 原来的列与行索引构成复合索引
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close   Adj Close  \
Date       minor
2012-05-30 AAPL    81.314285   82.855713   80.937141   82.738571   74.436249
           AMZN   212.139999  212.979996  207.750000  209.229996  209.229996
           GOOGL  294.374359  296.246246  292.057068  294.409424  294.409424
           MSFT    29.350000   29.480000   29.120001   29.340000   25.440367
2012-05-31 AAPL    82.962860   83.071426   81.637146   82.532860   74.251175
           AMZN   209.479996  213.789993  207.110001  212.910004  212.910004
           GOOGL  294.654663  295.295288  289.789795  290.720734  290.720734
           MSFT    29.299999   29.420000   28.940001   29.190001   25.310303
2012-06-01 AAPL    81.308571   81.807144   80.074287   80.141426   72.099739
           AMZN   208.440002  211.229996  207.300003  208.220001  208.220001
           GOOGL  286.181183  286.611603  284.459473  285.775787  285.775787
           MSFT    28.760000   28.959999   28.440001   28.450001   24.668653
2012-06-04 AAPL    80.214287   81.071426   78.357140   80.612854   72.523842
           AMZN   207.399994  215.350006  206.369995  214.570007  214.570007
           GOOGL  285.395386  290.535522  285.290283  289.584595  289.584595
           MSFT    28.620001   28.780001   28.320000   28.549999   24.755363
2012-06-05 AAPL    80.181427   80.924286   79.761429   80.404289   72.336205
           AMZN   213.850006  216.860001  211.160004  213.210007  213.210007
           GOOGL  288.013000  289.354340  283.518524  285.490479  285.490479
           MSFT    28.510000   28.750000   28.389999   28.510000   24.720682
2012-06-06 AAPL    81.110001   81.978569   80.785713   81.637146   73.445358
           AMZN   214.630005  218.399994  214.520004  217.639999  217.639999
           GOOGL  288.528534  291.276276  287.092102  290.575562  290.575562
           MSFT    28.879999   29.370001   28.809999   29.350000   25.449030
2012-06-07 AAPL    82.470001   82.474289   81.500000   81.674286   73.478767
           AMZN   219.649994  221.490005  218.110001  218.800003  218.800003
           GOOGL  294.094086  294.239227  288.913910  289.404419  289.404419
           MSFT    29.639999   29.700001   29.170000   29.230000   25.344986
2012-06-08 AAPL    81.657143   82.940002   81.285713   82.902855   74.584061
           AMZN   218.610001  219.419998  216.660004  218.479996  218.479996
...                      ...         ...         ...         ...         ...
2017-08-11 GOOGL  923.710022  933.359985  921.219971  930.090027  930.090027
           MSFT    71.610001   72.699997   71.279999   72.500000   72.115776
2017-08-14 AAPL   159.320007  160.210007  158.750000  159.850006  159.850006
           AMZN   978.409973  985.500000  976.190002  983.299988  983.299988
           GOOGL  939.070007  941.039978  934.489990  938.929993  938.929993
           MSFT    73.059998   73.720001   72.949997   73.589996   73.199997
2017-08-15 AAPL   160.660004  162.199997  160.139999  161.600006  161.600006
           AMZN   988.900024  991.739990  982.000000  982.739990  982.739990
           GOOGL  941.030029  943.070007  936.640015  938.080017  938.080017
           MSFT    73.589996   73.589996   73.040001   73.220001   73.220001
2017-08-16 AAPL   161.940002  162.509995  160.149994  160.949997  160.949997
           AMZN   981.650024  986.460022  973.219971  978.179993  978.179993
           GOOGL  941.250000  949.900024  940.039978  944.270020  944.270020
           MSFT    73.339996   74.099998   73.169998   73.650002   73.650002
2017-08-17 AAPL   160.520004  160.710007  157.839996  157.860001  157.860001
           AMZN   977.840027  977.840027  960.320007  960.570007  960.570007
           GOOGL  942.950012  943.809998  927.640015  927.659973  927.659973
           MSFT    73.580002   73.870003   72.400002   72.400002   72.400002
2017-08-18 AAPL   157.860001  159.500000  156.720001  157.500000  157.500000
           AMZN   961.400024  965.429993  954.650024  958.469971  958.469971
           GOOGL  926.979980  931.020020  923.450012  926.179993  926.179993
           MSFT    72.269997   72.839996   71.930000   72.489998   72.489998
2017-08-21 AAPL   157.500000  157.889999  155.110001  157.210007  157.210007
           AMZN   957.570007  961.200012  945.460022  953.289978  953.289978
           GOOGL  925.770020  928.250000  918.599976  920.869995  920.869995
           MSFT    72.470001   72.480003   71.699997   72.150002   72.150002
2017-08-22 AAPL   158.229996  160.000000  158.020004  159.779999  159.779999
           AMZN   955.520020  967.929993  955.494995  966.900024  966.900024
           GOOGL  926.960022  941.961670  926.169983  940.400024  940.400024
           MSFT    72.349998   73.239998   72.349998   73.160004   73.160004

                       Volume
Date       minor
2012-05-30 AAPL   132357400.0
           AMZN     4078200.0
           GOOGL    3809500.0
           MSFT    41585500.0
2012-05-31 AAPL   122918600.0
           AMZN     4944000.0
           GOOGL    5930600.0
           MSFT    39134000.0
2012-06-01 AAPL   130246900.0
           AMZN     3951500.0
           GOOGL    6109600.0
           MSFT    56634300.0
2012-06-04 AAPL   139248900.0
           AMZN     4299600.0
           GOOGL    4860500.0
           MSFT    47926300.0
2012-06-05 AAPL    97053600.0
           AMZN     3543900.0
           GOOGL    4675100.0
           MSFT    45715400.0
2012-06-06 AAPL   100363900.0
           AMZN     2710100.0
           GOOGL    4187400.0
           MSFT    46860500.0
2012-06-07 AAPL    94941700.0
           AMZN     3503900.0
           GOOGL    3513400.0
           MSFT    37792800.0
2012-06-08 AAPL    86879100.0
           AMZN     2877000.0
...                       ...
2017-08-11 GOOGL    1616700.0
           MSFT    21443700.0
2017-08-14 AAPL    22028200.0
           AMZN     3042800.0
           GOOGL    1150600.0
           MSFT    20067300.0
2017-08-15 AAPL    29465500.0
           AMZN     2549300.0
           GOOGL    1106500.0
           MSFT    19181400.0
2017-08-16 AAPL    27671600.0
           AMZN     3132100.0
           GOOGL    1345300.0
           MSFT    18150400.0
2017-08-17 AAPL    27940600.0
           AMZN     3512400.0
           GOOGL    1695700.0
           MSFT    22977500.0
2017-08-18 AAPL    27428100.0
           AMZN     3284800.0
           GOOGL    1337400.0
           MSFT    18761500.0
2017-08-21 AAPL    26178400.0
           AMZN     3144000.0
           GOOGL    1298900.0
           MSFT    17696100.0
2017-08-22 AAPL    21604585.0
           AMZN     2749970.0
           GOOGL    1775099.0
           MSFT    14343674.0

[5268 rows x 6 columns]

In [275]:
# 还原成面板数据
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1317 (major_axis) x 4 (minor_axis)
Items axis: Open to Volume
Major_axis axis: 2012-05-30 00:00:00 to 2017-08-22 00:00:00
Minor_axis axis: AAPL to MSFT